dataframe 연산

df-df간 연산

In [1]:
#모듈 로딩
import pandas as pd

In [2]:
#데이터 준비
data={'A':[98,78,100,52],'B':[90,70,10,50]}

In [3]:
#dict -> df
df1=pd.DataFrame(data)
df1

     A   B
0   98  90
1   78  70
2  100  10
3   52  50

In [4]:
df2=df1/4
df2

      A     B
0  24.5  22.5
1  19.5  17.5
2  25.0   2.5
3  13.0  12.5

In [5]:
#연산 수행_산술 연산
df1-df2

      A     B
0  73.5  67.5
1  58.5  52.5
2  75.0   7.5
3  39.0  37.5

In [6]:
#연산 수행_비교 연산
df1 <= df2

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

In [13]:
#df-series 연산 수행_산술 연산
sr1=df1.A
sr1

0     98
1     78
2    100
3     52
Name: A, dtype: int64

In [12]:
sr1+df2

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [15]:
#sr -> df
srdf=sr1.to_frame()
srdf

     A
0   98
1   78
2  100
3   52

In [16]:
df1+srdf

     A   B
0  196 NaN
1  156 NaN
2  200 NaN
3  104 NaN

In [21]:
sr1

0     98
1     78
2    100
3     52
Name: A, dtype: int64

In [22]:
df1.columns=[0,1]
df1

     0   1
0   98  90
1   78  70
2  100  10
3   52  50

In [23]:
df1+sr1.T

     0    1   2   3
0  196  168 NaN NaN
1  176  148 NaN NaN
2  198   88 NaN NaN
3  150  128 NaN NaN

In [24]:
df1.T

    0   1    2   3
0  98  78  100  52
1  90  70   10  50

In [20]:
df1.T+sr1

     0    1    2    3
0  196  156  200  104
1  188  148  110  102